[
  {
    "name": "Get 10% off",
    "description": "Promotions, new products and sales. Directly to your inbox.",
    "country": "Africa",
    "imageUrl": ""
  },
  {
    "name": "Muamba de Galinha - Angola",
    "description": "Muamba de Galinha is a dish from Angola that is made with chicken, peanut butter, and okra. The chicken is cooked in peanut butter and okra until it is tender. The dish is often served over rice. Muamba de Galinha is a hearty and flavourful dish that is sure to please.",
    "country": "Angola",
    "imageUrl": ""
  },
  {
    "name": "Kabsa - Saudi Arabia",
    "description": "Kabsa is a popular dish from Saudi Arabia that is made with chicken, rice, and spices. It is typically served with a side of salad and bread. The dish has a spicy flavour and is very hearty. Kabsa is a great option for a winter meal.",
    "country": "Africa",
    "imageUrl": ""
  },
  {
    "name": "Jollof rice - Nigeria",
    "description": "Jollof rice is a popular dish in many African countries. It is typically made with rice, tomatoes, onion, and chilli pepper. Jollof rice is often served with chicken or fish. The dish is said to have originated in Nigeria, but it is also popular in Ghana, Senegal, and other African countries. Jollof rice is usually prepared by boiling the rice in a pot of water or broth. Once the rice is cooked, the tomato sauce and other ingredients are added to the pot. The dish is simmered until all of the ingredients are fully cooked. Jollof rice is typically served hot and garnished with green onions or parsley.",
    "country": "Senegal",
    "imageUrl": ""
  },
  {
    "name": "Bobotie - South Africa",
    "description": "When it comes to African cuisine, there is certainly no shortage of delicious dishes to choose from. One of the most popular options is the Bobotie, a savoury pie that originates from South Africa. The dish is made with ground beef or lamb that is mixed with eggs, bread crumbs, and a variety of spices. Once the filling is cooked, it is topped with a custard-like mixture and baked until golden brown. Bobotie can be served hot or cold and is often garnished with raisins or dried fruit. Whether you're looking for a hearty meal or a tasty snack, Bobotie is sure to satisfy you.",
    "country": "South Africa",
    "imageUrl": ""
  },
  {
    "name": "Kushari - Egypt",
    "description": "Kushari is a dish that originates from Egypt. It is made up of rice, macaroni, and lentils, and is typically topped with tomato sauce. Kushari is one of the most popular dishes in Egypt and is often served as a street food. It is a hearty and filling dish and can be easily customized to suit any dietary needs. Kushari is a great example of the diversity of African cuisine. There are many different types of African dishes, each with its unique flavour. However, what they all have in common is that they are hearty and nutritious. So if you're ever in the mood for something new, be sure to give Kushari a try.",
    "country": "Egypt",
    "imageUrl": ""
  },
  {
    "name": "Couscous - Algeria",
    "description": "For many people, the word couscous conjures up images of a bland, dry grain that is best avoided. However, when prepared correctly, couscous can be a delicious and nutritious meal. Originating in Algeria, couscous is a staple of many African dishes. It is made from durum wheat semolina, which is boiled and then rolled into small pellets. The pellets are then steamed, resulting in a fluffy, light grain. Couscous can be served plain or with vegetables, meat, or fish. It is also common to add spices or herbs for additional flavour. Whether you are looking for a quick and easy meal or a traditional African dish, couscous is a great option.",
    "country": "Algeria",
    "imageUrl": ""
  },
  {
    "name": "Ful medames - Sudan",
    "description": "Ful medames is one of the most popular dishes in Sudan. It is a stew made from fava beans, spices, and vegetables. The dish is typically served with bread or rice. Ful medames is usually considered a breakfast food, but it can be eaten at any time of day. The dish is healthy and filling, and it is also very inexpensive to make. Sudanese people often eat Ful medames as a quick snack or as a complete meal. The dish is also popular in other parts of Africa, including Egypt and Ethiopia. In Sudan, Ful medames is often served with a side of sour cream or yoghurt. This helps to cool the spice of the stew and makes it more palatable for some people. If you are ever in Sudan, be sure to try this delicious and nutritious dish!",
    "country": "Sudan",
    "imageUrl": ""
  },
  {
    "name": "Couscous - Morocco",
    "description": "Couscous is a traditional dish in many African countries, including Morocco. It is made from semolina flour, which is coarsely ground wheat. The flour is mixed with water and salt and then formed into small pellets. These pellets are steamed, and the resulting dish is light and fluffy. Couscous can be served plain, or with a variety of sauces and vegetables. In Morocco, it is often served with a spicy lamb stew, called a Tagine. Couscous is a versatile dish that can be adapted to any number of flavours, making it a favourite among Africans and non-Africans alike.",
    "country": "Morocco",
    "imageUrl": ""
  },
  {
    "name": "Shekla tibs - Ethiopia",
    "description": "Shekla tibs is a traditional Ethiopian dish consisting of sauteed meat and vegetables. The dish is typically made with lamb or beef, though chicken or fish can also be used. Shekla tibs is typically served with injera, a type of sourdough bread. The dish is also often served with a variety of side dishes, such as lentils, collard greens, and other vegetables. Shekla tibs is a delicious and healthy dish that is perfect for any occasion. The combination of flavours and textures in this dish is truly unique and will leave you wanting more. Whether you're looking for a quick and easy weeknight meal or want to impress guests at a dinner party, Shekla tibs is the perfect dish to try. So what are you waiting for? Give this delicious Ethiopian dish a try today!",
    "country": "Ethiopia",
    "imageUrl": ""
  },
  {
    "name": "Ugali - Kenya",
    "description": "African food is as diverse as the continent itself, with each region boasting its own unique flavours and ingredients. One of the most popular dishes on the continent is Ugali, a thick maize porridge that originated in Kenya. Ugali is traditionally made by boiling water and then stirring in maize flour until it forms a thick paste. The paste is then left to cook until it forms a solid mass that can be cut into individual portions. Ugali is usually served with a stew or sauce, and it can also be enjoyed with fried vegetables or meat. Thanks to its simple ingredients and easy-to-follow recipe, Ugali has become a staple dish in households across Africa.",
    "country": "Kenya",
    "imageUrl": ""
  },
  {
    "name": "Fufu and Soup - Ghana",
    "description": "Fufu and soup is one of the most popular dishes in Ghana. It is typically made with cassava or yam flour, and it can be served with a variety of soups and stews. While it may not be the most glamorous dish, it is hearty and filling, and it has become a staple of Ghanaian cuisine. Fufu is usually eaten with the hands, and it is a perfect way to enjoy the flavours of Ghanaian soups and stews. So if you ever find yourself in Ghana, make sure to try this dish! You won't be disappointed.",
    "country": "Africa",
    "imageUrl": ""
  },
  {
    "name": "Poulet à la Moambé - DR Congo",
    "description": "Main African dishes are usually pretty simple. They typically consist of starch, like rice or cassava, and a protein, like chicken or fish. But now and then, you come across a truly special dish. Poulet à la Moambé is one of those dishes. hailing from the Congo, this dish is truly unique. The chicken is marinated in a mixture of peanut butter, ginger, and garlic, and then fried until crispy. It's then simmered in a flavorful sauce made with tomatoes, onion, and red bell pepper. The result is a dish that is both flavorful and comforting. Whether you're looking for something new to try or just want to enjoy a delicious meal, Poulet à la Moambé is worth trying.",
    "country": "Congo",
    "imageUrl": ""
  },
  {
    "name": "Fufu - Côte d'Ivoire",
    "description": "Fufu is one of the most popular dishes in Côte d'Ivoire, and for good reason. This hearty dish is made from a variety of starchy vegetables, including yams, cassava, and plantains. The vegetables are first boiled and then pounded into a thick paste. Fufu can be served with several different sauces, but it is typically served with a spinach stew or a peanut sauce. While it may take some time to prepare, Fufu is a delicious and filling meal that is sure to satisfy even the most discerning appetites. Thanks to its popularity, fufu has become one of the most recognizable African dishes around the world.",
    "country": "Africa",
    "imageUrl": ""
  },
  {
    "name": "Sangah - Cameroon",
    "description": "Sangah is one of Cameroon's national dishes. The dish is made with tomato sauce, various types of meat, and vegetables. The dish is usually served with plantains, yams, and rice. Sangah is a very popular dish in Cameroon and is often served at special occasions such as weddings and funerals. The dish is also popular in other African countries such as Nigeria and Ghana. Sangah is a very hearty and filling dish that is sure to satisfy even the most hungry appetites.",
    "country": "Nigeria",
    "imageUrl": ""
  },
  {
    "name": "Matooke - Uganda",
    "description": "Matooke is a traditional Ugandan dish made from steamed plantains. It is usually served with peanut sauce or stew and is often the centrepiece of special occasions. Matooke is a popular dish in many African countries, and each region has its own unique twist on the dish. For example, in Kenya the plantains are boiled instead of steamed, and in Tanzania they are traditionally cooked with beef or chicken. No matter how it is prepared, Matooke is a delicious and nutritious dish that is sure to please any appetite.",
    "country": "Uganda",
    "imageUrl": ""
  },
  {
    "name": "Nshima - Zambia",
    "description": "Nshima is a dish from Zambia that is made from maize flour. It is one of the most popular dishes in Africa and is typically served with vegetables, meat, or fish. Nshima is a very filling dish and is often eaten as a main meal. It is usually cooked over a fire, which gives it a smoky flavour. Nshima is a very versatile dish and can be made into many different shapes and sizes. It can be rolled into balls, flattened into discs, or even made into a thick paste. No matter how it is prepared, Nshima is sure to provide a satisfying and nutritious meal.  African cuisine is as diverse as the continent itself, with each region boasting its unique flavours and ingredients. While some dishes, such as jollof rice and battled veggies, are enjoyed throughout the continent, others are more traditional to specific regions. From stews and curries to bread and porridge, these 16 dishes represent the best of African cuisine. So next time you're looking for a new culinary adventure, be sure to try one of these amazing African dishes. You won't be disappointed! African cuisine offers a rich tapestry of flavors and dishes, from the aromatic Jollof Rice of West Africa to the spicy piri piri chicken of Mozambique. Explore the diverse culinary traditions of the continent, including tagines from North Africa, fufu from West and Central Africa, and injera from Ethiopia and Eritrea. Fufu is a traditional African dish that serves as a staple food in many parts of West and Central Africa. It's typically made from starchy ingredients like cassava, yams, or plantains, which are boiled, pounded, and formed into a smooth, dough-like consistency. Fufu is often served alongside soups, stews, or sauces, and it's eaten by tearing off small pieces and using them to scoop up the accompanying dishes. It's known for its versatility, nutritional value, and importance in various African cultures. North Africa's traditional dish is couscous. Originating from the Berber people of the region, couscous is made from steamed and dried semolina wheat. It's a staple food in countries like Morocco, Algeria, Tunisia, Libya, and Mauritania. Couscous is often served as a base for stews made with vegetables, meats, or seafood, creating a delicious and hearty meal enjoyed across the region. Jollof Rice stands as one of Nigeria's signature dishes, featuring a flavorful blend of rice, tomatoes, onions, and a medley of spices. It's a beloved staple often accompanied by succulent grilled or fried meats, chicken, or fish, embodying the rich culinary heritage of Nigerian cuisine. Ready to elevate your culinary explorations and create unforgettable memories along the way? Get your deck of 50 travel challenges and let the feast for your senses begin. Bon appétit, buon appetito, guten Appetit, and happy travels!",
    "country": "North Africa",
    "imageUrl": ""
  }
]